first = int(input("Please enter the first number:"))
second = int(input("Please enter the second number:"))

# ***** Перевірка числа - менше, більше, дорівнює *****

# if first > second:
#     print("Перше число більше за друге")
# elif first == second:
#     print("Перше число дорівнює другому")
# else:
#     print("Перше число менше за друге")


# ***** Перевірка числа на парність *****

# if first % 2 == 0:
# # if not first % 2:
#     print('Перше число є парним')
# else:
#     print('Перше число не є парним')



# ***** Перевірка на кратність якомусь числу  *****

# if first % 3:
#     print('Перше число не є кратним 3')
# else:
#     print('Перше число є кратним 3')


# ***** Додавання умови на парність першого або кратність другого числа *****

if first % 2 and second % 3:
    print('Перше число не кратне 2 або друге число не кратне 3')
else:
    print('Перше число кратне 2 або друге число кратне 3')